# Основы работы с pandas

## Введение

In [1]:
4+8

12

In [4]:
sum((4,5,6))

15

In [5]:
print('Hello!')

Hello!

## Импорт и типы данных

In [108]:
import pandas as pd
import numpy as nm

In [109]:
data = pd.read_csv("C:/DataScience/mlcourse_open-master/data/beauty.csv", sep=';')

In [110]:
type(data)

pandas.core.frame.DataFrame

In [111]:
data.head()

    wage  exper  union  goodhlth  black  female  married  service  educ  looks
0   5.73     30      0         1      0       1        1        1    14      4
1   4.28     28      0         1      0       1        1        0    12      3
2   7.96     35      0         1      0       1        0        0    10      4
3  11.57     38      0         1      0       0        1        1    16      3
4  11.42     27      0         1      0       0        1        0    16      3

In [112]:
data

,wage,exper,union,goodhlth,black,female,married,service,educ,looks
0,5.73,30,0,1,0,1,1,1,14,4
1,4.28,28,0,1,0,1,1,0,12,3
2,7.96,35,0,1,0,1,0,0,10,4
3,11.57,38,0,1,0,0,1,1,16,3
4,11.42,27,0,1,0,0,1,0,16,3
...,...,...,...,...,...,...,...,...,...,...
1255,1.61,25,0,1,1,1,0,1,12,3
1256,1.68,4,0,1,0,1,1,1,12,2
1257,3.29,35,0,1,1,1,0,1,12,3
1258,2.31,15,0,1,1,1,1,1,10,3
1259,1.92,24,0,0,0,1,0,1,16,3

По умолчания Pandas выводит 20 столбцов и 60 строк. Можно изменить параметры по умолчанию:

In [113]:
pd.set_option('display.max_columns',100)
pd.set_option('display.max_rows', 10)
data

,wage,exper,union,goodhlth,black,female,married,service,educ,looks
0,5.73,30,0,1,0,1,1,1,14,4
1,4.28,28,0,1,0,1,1,0,12,3
2,7.96,35,0,1,0,1,0,0,10,4
3,11.57,38,0,1,0,0,1,1,16,3
4,11.42,27,0,1,0,0,1,0,16,3
...,...,...,...,...,...,...,...,...,...,...
1255,1.61,25,0,1,1,1,0,1,12,3
1256,1.68,4,0,1,0,1,1,1,12,2
1257,3.29,35,0,1,1,1,0,1,12,3
1258,2.31,15,0,1,1,1,1,1,10,3
1259,1.92,24,0,0,0,1,0,1,16,3

Просмотр размерности датафрейма:

In [14]:
data.shape

(1260, 10)

In [16]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1260 entries, 0 to 1259
Data columns (total 10 columns):
wage        1260 non-null float64
exper       1260 non-null int64
union       1260 non-null int64
goodhlth    1260 non-null int64
black       1260 non-null int64
female      1260 non-null int64
married     1260 non-null int64
service     1260 non-null int64
educ        1260 non-null int64
looks       1260 non-null int64
dtypes: float64(1), int64(9)
memory usage: 98.5 KB

Основные статистики:

In [22]:
data.describe()

,wage,exper,union,goodhlth,black,female,married,service,educ,looks
count,1260.000000,1260.000000,1260.000000,1260.000000,1260.000000,1260.000000,1260.000000,1260.000000,1260.000000,1260.000000
mean,6.306690,18.206349,0.272222,0.933333,0.073810,0.346032,0.691270,0.273810,12.563492,3.185714
std,4.660639,11.963485,0.445280,0.249543,0.261564,0.475892,0.462153,0.446089,2.624489,0.684877
min,1.020000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,5.000000,1.000000
25%,3.707500,8.000000,0.000000,1.000000,0.000000,0.000000,0.000000,0.000000,12.000000,3.000000
50%,5.300000,15.000000,0.000000,1.000000,0.000000,0.000000,1.000000,0.000000,12.000000,3.000000
75%,7.695000,27.000000,1.000000,1.000000,0.000000,1.000000,1.000000,1.000000,13.000000,4.000000
max,77.720000,48.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,17.000000,5.000000

In [23]:
data['wage'].describe()

count    1260.000000
mean        6.306690
std         4.660639
min         1.020000
25%         3.707500
50%         5.300000
75%         7.695000
max        77.720000
Name: wage, dtype: float64

Для отображения статистики по нечисловым признакам, необходимо в параметрах указать интересующие типы данных:

In [114]:
data['black'] = data['black'].astype('bool')
data.describe(include=['object', 'bool'])

        black
count    1260
unique      2
top     False
freq     1167

In [31]:
print(data.columns)

Index(['wage', 'exper', 'union', 'goodhlth', 'black', 'female', 'married',
       'service', 'educ', 'looks'],
      dtype='object')

Обращение к столбцам возможно в двух форматах: <i>имя_дф['имя_столбца']</i> или <i>имя_дф.имя_столбца</i>

In [24]:
data['wage']

0        5.73
1        4.28
2        7.96
3       11.57
4       11.42
        ...
1255     1.61
1256     1.68
1257     3.29
1258     2.31
1259     1.92
Name: wage, Length: 1260, dtype: float64

In [25]:
data.wage

0        5.73
1        4.28
2        7.96
3       11.57
4       11.42
        ...
1255     1.61
1256     1.68
1257     3.29
1258     2.31
1259     1.92
Name: wage, Length: 1260, dtype: float64

In [26]:
data['exper'].head()

0    30
1    28
2    35
3    38
4    27
Name: exper, dtype: int64

Преобразование типов:

In [87]:
data['female'].astype('bool')

0        True
1        True
2        True
3       False
4       False
        ...
1255     True
1256     True
1257     True
1258     True
1259     True
Name: female, Length: 1260, dtype: bool

Подсчет количества:

In [35]:
data['black'].value_counts()

False    1167
True       93
Name: black, dtype: int64

Подсчет нормализованных значений

In [41]:
data['black'].value_counts(normalize=True)

False    0.92619
True     0.07381
Name: black, dtype: float64

## Сортировка

In [44]:
data.sort_values(by='wage', ascending=False)

,wage,exper,union,goodhlth,black,female,married,service,educ,looks
602,77.72,9,1,1,True,1,1,1,13,4
269,41.67,16,0,0,False,0,1,0,13,4
415,38.86,29,0,1,False,0,1,0,13,3
69,32.79,33,0,1,False,0,1,1,16,4
290,31.09,32,0,0,False,0,1,0,13,3
...,...,...,...,...,...,...,...,...,...,...
597,1.16,5,0,1,False,1,1,1,10,3
462,1.16,2,0,1,False,1,0,0,13,4
1226,1.09,8,0,1,False,1,1,1,10,2
1009,1.05,29,0,1,True,0,1,0,5,3
1214,1.02,11,0,1,False,1,1,1,13,3

In [47]:
data.sort_values(by=['educ', 'wage'], ascending=False)

,wage,exper,union,goodhlth,black,female,married,service,educ,looks
68,29.98,12,0,1,False,0,1,1,17,3
396,26.22,17,0,1,False,0,1,1,17,3
76,23.32,15,0,1,False,0,1,1,17,5
72,21.63,11,0,1,False,0,1,1,17,3
75,20.99,40,0,1,False,0,1,1,17,2
...,...,...,...,...,...,...,...,...,...,...
947,1.98,35,0,1,True,0,1,0,5,4
926,1.92,26,0,0,False,1,1,0,5,3
1149,1.26,32,0,1,True,1,0,0,5,1
1253,1.22,10,0,1,False,1,0,1,5,3
1009,1.05,29,0,1,True,0,1,0,5,3

## Индексация

In [57]:
data['wage']

0        5.73
1        4.28
2        7.96
3       11.57
4       11.42
        ...
1255     1.61
1256     1.68
1257     3.29
1258     2.31
1259     1.92
Name: wage, Length: 1260, dtype: float64

Для индексации также используются функции loc (индексация по названию сток и/или столбцов) и iloc (по порядковым номерам):

In [62]:
data.loc[0:5, 'wage':'female'] #вывод строк с именами от 0 до 5 и столбцов с именами от wage до female

    wage  exper  union  goodhlth  black  female
0   5.73     30      0         1  False       1
1   4.28     28      0         1  False       1
2   7.96     35      0         1  False       1
3  11.57     38      0         1  False       0
4  11.42     27      0         1  False       0
5   3.91     20      0         0  False       1

In [63]:
data.iloc[:,2:4] #вывод всех строк и столбцов с индексами от 3 до 4

      union  goodhlth
0         0         1
1         0         1
2         0         1
3         0         1
4         0         1
...     ...       ...
1255      0         1
1256      0         1
1257      0         1
1258      0         1
1259      0         0

[1260 rows x 2 columns]

In [68]:
data[:1] # Первая строка

   wage  exper  union  goodhlth  black  female  married  service  educ  looks
0  5.73     30      0         1  False       1        1        1    14      4

In [70]:
data[-1:] # Последняя строка

,wage,exper,union,goodhlth,black,female,married,service,educ,looks
1259,1.92,24,0,0,False,1,0,1,16,3

In [49]:
data['female']==1

0        True
1        True
2        True
3       False
4       False
        ...
1255     True
1256     True
1257     True
1258     True
1259     True
Name: female, Length: 1260, dtype: bool

In [50]:
data[data['female']==1]

,wage,exper,union,goodhlth,black,female,married,service,educ,looks
0,5.73,30,0,1,False,1,1,1,14,4
1,4.28,28,0,1,False,1,1,0,12,3
2,7.96,35,0,1,False,1,0,0,10,4
5,3.91,20,0,0,False,1,1,0,12,3
8,5.00,5,0,1,False,1,0,0,16,3
...,...,...,...,...,...,...,...,...,...,...
1255,1.61,25,0,1,True,1,0,1,12,3
1256,1.68,4,0,1,False,1,1,1,12,2
1257,3.29,35,0,1,True,1,0,1,12,3
1258,2.31,15,0,1,True,1,1,1,10,3
1259,1.92,24,0,0,False,1,0,1,16,3

In [51]:
data[data['female']==1]['wage'].mean()

4.299357798165136

In [50]:
data[(data['female']==0) & (data['married']==1)]['wage'].median(), \
data[(data['female']==0) & (data['married']==0)]['wage'].median(),

(6.710000000000001, 5.0649999999999995)

### Просмотр справки

In [51]:
?pd.read_csv

In [53]:
pd.read_csv?

## Группировка

In [89]:
data.groupby('looks')

In [56]:
for i in data.groupby('looks'):
    print(type(i))

<class 'tuple'>
<class 'tuple'>
<class 'tuple'>
<class 'tuple'>
<class 'tuple'>

In [92]:
for look, sub_df in data.groupby('looks'):
    print(look)

1
2
3
4
5

In [71]:
for look, sub_df in data.groupby('looks'):
    print(look)
    print(sub_df)

1
       wage  exper  union  goodhlth  black  female  married  service  educ  \
28     8.35     41      0         0  False       0        1        1    16
200    3.75     36      0         1  False       0        0        0    12
248   10.99     40      0         1  False       0        1        0    12
327    1.65     24      0         1  False       1        0        1    13
751    7.93     39      1         1  False       0        1        0    12
...     ...    ...    ...       ...    ...     ...      ...      ...   ...
980    2.31     35      1         1  False       0        1        0     5
1126   3.46     26      0         1  False       1        0        1     5
1149   1.26     32      0         1   True       1        0        0     5
1171   2.25     12      0         1   True       1        0        0     5
1213   2.15      6      0         1  False       1        1        1    12

      looks
28        1
200       1
248       1
327       1
751       1
...     ...
980       1
1126      1
1149      1
1171      1
1213      1

[13 rows x 10 columns]
2
      wage  exper  union  goodhlth  black  female  married  service  educ  \
12    5.14     19      0         1  False       0        1        1    17
33    8.17     18      0         1  False       0        1        0    16
35    9.62     37      0         1  False       0        1        0    13
37    7.69     10      1         1  False       0        1        0    13
57    6.56     17      0         1  False       0        1        0    13
...    ...    ...    ...       ...    ...     ...      ...      ...   ...
1225  5.82     20      0         1  False       1        0        1    17
1226  1.09      8      0         1  False       1        1        1    10
1236  4.81     31      0         1  False       0        1        0    12
1241  5.34     20      0         1  False       0        1        0    12
1256  1.68      4      0         1  False       1        1        1    12

      looks
12        2
33        2
35        2
37        2
57        2
...     ...
1225      2
1226      2
1236      2
1241      2
1256      2

[142 rows x 10 columns]
3
       wage  exper  union  goodhlth  black  female  married  service  educ  \
1      4.28     28      0         1  False       1        1        0    12
3     11.57     38      0         1  False       0        1        1    16
4     11.42     27      0         1  False       0        1        0    16
5      3.91     20      0         0  False       1        1        0    12
6      8.76     12      0         1  False       0        1        0    16
...     ...    ...    ...       ...    ...     ...      ...      ...   ...
1254   1.79     20      0         1  False       1        1        1     8
1255   1.61     25      0         1   True       1        0        1    12
1257   3.29     35      0         1   True       1        0        1    12
1258   2.31     15      0         1   True       1        1        1    10
1259   1.92     24      0         0  False       1        0        1    16

      looks
1         3
3         3
4         3
5         3
6         3
...     ...
1254      3
1255      3
1257      3
1258      3
1259      3

[722 rows x 10 columns]
4
       wage  exper  union  goodhlth  black  female  married  service  educ  \
0      5.73     30      0         1  False       1        1        1    14
2      7.96     35      0         1  False       1        0        0    10
7      7.69      5      1         1  False       0        0        0    16
10     3.45      3      0         1  False       1        0        0    12
11     4.03      6      0         1  False       0        1        0    16
...     ...    ...    ...       ...    ...     ...      ...      ...   ...
1239   4.62     10      0         1  False       0        1        0    13
1240   2.40     12      0         1  False       0        0        1    12
1243   4.72      9      1         1  False       0        1        0    13
1247   5.31      3      0         1  False       0        0        0    17
1248  10.58     19      0         1  False       0        0        0    16

      looks
0         4
2         4
7         4
10        4
11        4
...     ...
1239      4
1240      4
1243      4
1247      4
1248      4

[364 rows x 10 columns]
5
       wage  exper  union  goodhlth  black  female  married  service  educ  \
26    14.84     29      0         1  False       0        0        1    13
27    19.08     17      0         1  False       0        0        0    17
76    23.32     15      0         1  False       0        1        1    17
112    6.11      7      0         1  False       1        1        0    12
316    3.92     12      0         1  False       0        1        1    12
...     ...    ...    ...       ...    ...     ...      ...      ...   ...
659   12.66     22      1         1  False       0        1        0    12
952    4.81      6      0         1  False       0        1        0    16
1013   3.61      6      0         1  False       0        0        0    12
1017   4.49     17      1         1  False       0        1        0    10
1200   2.07      5      1         1  False       1        0        1    12

      looks
26        5
27        5
76        5
112       5
316       5
...     ...
659       5
952       5
1013      5
1017      5
1200      5

[19 rows x 10 columns]

In [59]:
for look, sub_df in data.groupby('looks'):
    print(look)
    print(sub_df['female'].mean())

1
0.38461538461538464
2
0.38028169014084506
3
0.32271468144044324
4
0.37362637362637363
5
0.42105263157894735

In [60]:
for look, sub_df in data.groupby('looks'):
    print(look)
    print(sub_df['wage'].mean())

1
4.621538461538462
2
5.328802816901409
3
6.504598337950134
4
6.299340659340659
5
7.38842105263158

Группировка по 2-м признакам:

In [93]:
for look, sub_df in data.groupby(['looks', 'female']):
    print(look)
    print(sub_df)

(1, 0)
      wage  exper  union  goodhlth  black  female  married  service  educ  \
28    8.35     41      0         0  False       0        1        1    16
200   3.75     36      0         1  False       0        0        0    12
248  10.99     40      0         1  False       0        1        0    12
751   7.93     39      1         1  False       0        1        0    12
837   5.56     10      0         1  False       0        1        0    13
842   7.69      9      1         0  False       0        1        0    12
877   2.73     41      0         1  False       0        1        0     8
980   2.31     35      1         1  False       0        1        0     5

     looks
28       1
200      1
248      1
751      1
837      1
842      1
877      1
980      1
(1, 1)
      wage  exper  union  goodhlth  black  female  married  service  educ  \
327   1.65     24      0         1  False       1        0        1    13
1126  3.46     26      0         1  False       1        0        1     5
1149  1.26     32      0         1   True       1        0        0     5
1171  2.25     12      0         1   True       1        0        0     5
1213  2.15      6      0         1  False       1        1        1    12

      looks
327       1
1126      1
1149      1
1171      1
1213      1
(2, 0)
      wage  exper  union  goodhlth  black  female  married  service  educ  \
12    5.14     19      0         1  False       0        1        1    17
33    8.17     18      0         1  False       0        1        0    16
35    9.62     37      0         1  False       0        1        0    13
37    7.69     10      1         1  False       0        1        0    13
57    6.56     17      0         1  False       0        1        0    13
...    ...    ...    ...       ...    ...     ...      ...      ...   ...
1130  3.34     10      0         1  False       0        1        1    13
1138  1.17      1      0         1   True       0        0        0    12
1179  6.41     41      0         1  False       0        1        1    12
1236  4.81     31      0         1  False       0        1        0    12
1241  5.34     20      0         1  False       0        1        0    12

      looks
12        2
33        2
35        2
37        2
57        2
...     ...
1130      2
1138      2
1179      2
1236      2
1241      2

[88 rows x 10 columns]
(2, 1)
      wage  exper  union  goodhlth  black  female  married  service  educ  \
65    7.14     20      0         1  False       1        0        1    17
79    5.73     12      0         1  False       1        0        1    13
94    6.73     25      0         1  False       1        1        1    13
96    4.35      8      0         1  False       1        1        1    14
118   4.37     19      0         1  False       1        0        1    17
...    ...    ...    ...       ...    ...     ...      ...      ...   ...
1198  5.13     20      0         1   True       1        1        0    10
1215  2.40     10      0         1   True       1        1        1    12
1225  5.82     20      0         1  False       1        0        1    17
1226  1.09      8      0         1  False       1        1        1    10
1256  1.68      4      0         1  False       1        1        1    12

      looks
65        2
79        2
94        2
96        2
118       2
...     ...
1198      2
1215      2
1225      2
1226      2
1256      2

[54 rows x 10 columns]
(3, 0)
       wage  exper  union  goodhlth  black  female  married  service  educ  \
3     11.57     38      0         1  False       0        1        1    16
4     11.42     27      0         1  False       0        1        0    16
6      8.76     12      0         1  False       0        1        0    16
13     3.00      8      0         1  False       0        0        1    16
16     5.16      7      0         1  False       0        1        0    17
...     ...    ...    ...       ...    ...     ...      ...      ...   ...
1246   5.39      8      1         1  False       0        1        0    14
1249   8.65     10      1         1  False       0        1        0    13
1250   4.17     13      0         1  False       0        1        0    10
1251   6.81      7      1         1  False       0        0        0    12
1252   9.62     21      1         1  False       0        1        0    16

      looks
3         3
4         3
6         3
13        3
16        3
...     ...
1246      3
1249      3
1250      3
1251      3
1252      3

[489 rows x 10 columns]
(3, 1)
      wage  exper  union  goodhlth  black  female  married  service  educ  \
1     4.28     28      0         1  False       1        1        0    12
5     3.91     20      0         0  False       1        1        0    12
8     5.00      5      0         1  False       1        0        0    16
9     3.89     12      0         1  False       1        0        0    12
19    7.69      7      0         1  False       1        1        1    16
...    ...    ...    ...       ...    ...     ...      ...      ...   ...
1254  1.79     20      0         1  False       1        1        1     8
1255  1.61     25      0         1   True       1        0        1    12
1257  3.29     35      0         1   True       1        0        1    12
1258  2.31     15      0         1   True       1        1        1    10
1259  1.92     24      0         0  False       1        0        1    16

      looks
1         3
5         3
8         3
9         3
19        3
...     ...
1254      3
1255      3
1257      3
1258      3
1259      3

[233 rows x 10 columns]
(4, 0)
       wage  exper  union  goodhlth  black  female  married  service  educ  \
7      7.69      5      1         1  False       0        0        0    16
11     4.03      6      0         1  False       0        1        0    16
14     7.99     12      0         1  False       0        1        0    16
15     6.01     17      0         1  False       0        1        0    16
17    11.54     12      0         1  False       0        1        1    17
...     ...    ...    ...       ...    ...     ...      ...      ...   ...
1239   4.62     10      0         1  False       0        1        0    13
1240   2.40     12      0         1  False       0        0        1    12
1243   4.72      9      1         1  False       0        1        0    13
1247   5.31      3      0         1  False       0        0        0    17
1248  10.58     19      0         1  False       0        0        0    16

      looks
7         4
11        4
14        4
15        4
17        4
...     ...
1239      4
1240      4
1243      4
1247      4
1248      4

[228 rows x 10 columns]
(4, 1)
       wage  exper  union  goodhlth  black  female  married  service  educ  \
0      5.73     30      0         1  False       1        1        1    14
2      7.96     35      0         1  False       1        0        0    10
10     3.45      3      0         1  False       1        0        0    12
18    10.44     10      0         1  False       1        0        0    17
50     9.16     19      1         1  False       1        1        1    17
...     ...    ...    ...       ...    ...     ...      ...      ...   ...
1196   3.57      9      0         1  False       1        0        1    16
1220   5.49     13      0         1  False       1        1        1    12
1222   3.29     10      0         0  False       1        0        1    12
1223   2.88     15      0         1  False       1        0        1    12
1227   1.28     13      0         1  False       1        1        0    12

      looks
0         4
2         4
10        4
18        4
50        4
...     ...
1196      4
1220      4
1222      4
1223      4
1227      4

[136 rows x 10 columns]
(5, 0)
       wage  exper  union  goodhlth  black  female  married  service  educ  \
26    14.84     29      0         1  False       0        0        1    13
27    19.08     17      0         1  False       0        0        0    17
76    23.32     15      0         1  False       0        1        1    17
316    3.92     12      0         1  False       0        1        1    12
363   10.66      8      0         1  False       0        0        0    13
...     ...    ...    ...       ...    ...     ...      ...      ...   ...
653    7.96     15      0         1  False       0        1        0    12
659   12.66     22      1         1  False       0        1        0    12
952    4.81      6      0         1  False       0        1        0    16
1013   3.61      6      0         1  False       0        0        0    12
1017   4.49     17      1         1  False       0        1        0    10

      looks
26        5
27        5
76        5
316       5
363       5
...     ...
653       5
659       5
952       5
1013      5
1017      5

[11 rows x 10 columns]
(5, 1)
      wage  exper  union  goodhlth  black  female  married  service  educ  \
112   6.11      7      0         1  False       1        1        0    12
492   2.51      4      0         1  False       1        0        0    12
506   4.40      3      0         1  False       1        0        0    13
512   5.09      7      0         1  False       1        0        0    17
562   4.95     10      0         1   True       1        0        0    14
613   3.95      2      0         1  False       1        0        0    12
639   2.14     32      0         1  False       1        0        1    16
1200  2.07      5      1         1  False       1        0        1    12

      looks
112       5
492       5
506       5
512       5
562       5
613       5
639       5
1200      5

## Сводные таблицы

Таблицы сопряженности показывают распределение выборки между двумя признаками:

In [66]:
pd.crosstab(data['female'], data['married'])

married    0    1
female
0        166  658
1        223  213

In [102]:
pd.crosstab(data['female'], data['married'], normalize=True)

married         0         1
female
0        0.131746  0.522222
1        0.176984  0.169048

<p>Параметр normalize используется для расчёта распределений в долях.</p>
<p><b>Примечание:</b> 1 получается из суммы всех элементов таблицы.</p>

Помимо таблиц сопряженности в pandas используются сводные таблицы pivot_table с параметрами values (список переменных для статистики), index (список переменных для группировки) и aggfunc (функция расчета значений):

In [106]:
data.pivot_table(values=['wage', 'exper', 'educ'], index=['married'], aggfunc='mean') #или
data.pivot_table(['wage', 'exper', 'educ'], ['married'], aggfunc='mean')

              educ      exper      wage
married
0        12.750643  13.632391  5.020360
1        12.479908  20.249139  6.881183

## Функции

### Groupby

In [117]:
data.groupby(['educ'])['wage'].mean()

educ
5     4.587857
8     4.969091
10    5.524295
12    5.698205
13    6.642642
14    5.613529
16    7.792645
17    8.661061
Name: wage, dtype: float64

In [100]:
data.groupby(['looks'])['wage', 'female'].agg([nm.median, nm.mean])

        wage           female
      median      mean median      mean
looks
1      3.460  4.621538      0  0.384615
2      4.595  5.328803      0  0.380282
3      5.635  6.504598      0  0.322715
4      5.240  6.299341      0  0.373626
5      4.810  7.388421      0  0.421053

### Apply

Функция <i>apply</i> позволяет производить одинаковую операцию для каждого столбца:

In [93]:
data.apply(nm.mean)

wage         6.306690
exper       18.206349
union        0.272222
goodhlth     0.933333
black        0.073810
female       0.346032
married      0.691270
service      0.273810
educ        12.563492
looks        3.185714
is_reach     0.250000
dtype: float64

Функция также может быть исопльзована для расчета данных по строкам (axis=1):

In [73]:
data.apply(nm.median, axis=1)

0       1.0
1       1.0
2       1.0
3       1.0
4       1.0
       ...
1255    1.0
1256    1.0
1257    1.0
1258    1.0
1259    1.0
Length: 1260, dtype: float64

В качестве аргумента для <i>aplly</i> можно передавать собственные функции:

In [75]:
def string_gender(female):
    return 'female' if female else 'male'

In [96]:
string_gender(0), \
string_gender(1)

('male', 'female')

In [76]:
data['female'].apply(string_gender)

0       female
1       female
2       female
3         male
4         male
         ...
1255    female
1256    female
1257    female
1258    female
1259    female
Name: female, Length: 1260, dtype: object

### Map

Функция <i>map</i> используется для замены каждого значения в столбце:

In [79]:
d = {1:'union', 0:'non-union'} # создание словаря

In [80]:
data['union'].map(d)

0       non-union
1       non-union
2       non-union
3       non-union
4       non-union
          ...
1255    non-union
1256    non-union
1257    non-union
1258    non-union
1259    non-union
Name: union, Length: 1260, dtype: object

### Replace

В качестве аналогии <i>Map</i> можно использовать <i>Replace</i>:

In [81]:
d2={1:'black', 0:'white'}

In [82]:
data.replace({'black':d2})

,wage,exper,union,goodhlth,black,female,married,service,educ,looks
0,5.73,30,0,1,white,1,1,1,14,4
1,4.28,28,0,1,white,1,1,0,12,3
2,7.96,35,0,1,white,1,0,0,10,4
3,11.57,38,0,1,white,0,1,1,16,3
4,11.42,27,0,1,white,0,1,0,16,3
...,...,...,...,...,...,...,...,...,...,...
1255,1.61,25,0,1,black,1,0,1,12,3
1256,1.68,4,0,1,white,1,1,1,12,2
1257,3.29,35,0,1,black,1,0,1,12,3
1258,2.31,15,0,1,black,1,1,1,10,3
1259,1.92,24,0,0,white,1,0,1,16,3

### lambda

Lambda позволяет записывать формулы в виде одной строки

In [126]:
(lambda x: x*3)(12)

36

In [144]:
data['female'].apply(lambda x: 'healthy' if x==0 else 'ill')

0           ill
1           ill
2           ill
3       healthy
4       healthy
         ...
1255        ill
1256        ill
1257        ill
1258        ill
1259        ill
Name: female, Length: 1260, dtype: object

## Преобразование датафреймов

### Добавление признаков

In [145]:
data['wage'] > data['wage'].quantile(.75)

0       False
1       False
2        True
3        True
4        True
        ...
1255    False
1256    False
1257    False
1258    False
1259    False
Name: wage, Length: 1260, dtype: bool

In [160]:
data['is_reach'] = (data['wage'] > data['wage'].quantile(.75)).astype('int64')

или

In [161]:
new_column = data['wage']/70
data.insert(loc=1, column='wage_in_roubles', value = new_column) #loc определяет место вставки столбца

ValueError: cannot insert wage_in_roubles, already exists

In [162]:
data.head()

,wage,wage_in_roubles,exper,union,goodhlth,black,female,married,service,educ,looks,is_reach
0,5.73,0.081857,30,0,1,False,1,1,1,14,4,0
1,4.28,0.061143,28,0,1,False,1,1,0,12,3,0
2,7.96,0.113714,35,0,1,False,1,0,0,10,4,1
3,11.57,0.165286,38,0,1,False,0,1,1,16,3,1
4,11.42,0.163143,27,0,1,False,0,1,0,16,3,1

### Удаление признаков

In [163]:
data.drop(['wage_in_roubles', 'is_reach'], axis=1, inplace=True)

Параметр axis отвечает за удаляемую ось: 0 - строка (по умолчанию), 1 - столбец.
Параметр inplace - непосредственно за удаление: при значении False будет выведен ДФ с удалением, но без сохранения изменений

In [164]:
data.head()

    wage  exper  union  goodhlth  black  female  married  service  educ  looks
0   5.73     30      0         1  False       1        1        1    14      4
1   4.28     28      0         1  False       1        1        0    12      3
2   7.96     35      0         1  False       1        0        0    10      4
3  11.57     38      0         1  False       0        1        1    16      3
4  11.42     27      0         1  False       0        1        0    16      3